ZERO = ('нуль',)

ONES_FEMININE = {
    1: ('адна',),
    2: ('дзве',),
    3: ('тры',),
    4: ('чатыры',),
    5: ('пяць',),
    6: ('шэсць',),
    7: ('сем',),
    8: ('восем',),
    9: ('дзевяць',),
}

ONES = {
    1: ('адзін',),
    2: ('два',),
    3: ('тры',),
    4: ('чатыры',),
    5: ('пяць',),
    6: ('шэсць',),
    7: ('сем',),
    8: ('восем',),
    9: ('дзевяць',),
}

TENS = {
    0: ('дзесяць',),
    1: ('адзінаццаць',),
    2: ('дванаццаць',),
    3: ('трынаццаць',),
    4: ('чатырнаццаць',),
    5: ('пятнаццаць',),
    6: ('шаснаццаць',),
    7: ('сямнаццаць',),
    8: ('васямнаццаць',),
    9: ('дзевятнаццаць',),
}

TWENTIES = {
    2: ('дваццаць',),
    3: ('трыццаць',),
    4: ('сорак',),
    5: ('пяцьдзесят',),
    6: ('шэсцьдзесят',),
    7: ('семдзесят',),
    8: ('восемдзесят',),
    9: ('дзевяноста',),
}

HUNDREDS = {
    1: ('сто',),
    2: ('двесце',),
    3: ('трыста',),
    4: ('чатырыста',),
    5: ('пяцьсот',),
    6: ('шэсцьсот',),
    7: ('семсот',),
    8: ('васемсот',),
    9: ('дзевяцьсот',),
}

THOUSANDS = {
    1: ('тысяча', 'тысячы', 'тысячаў'),  # 10^3
    2: ('мильён', 'мільёна', 'мільёнаў'),  # 10^6
    3: ('мільярд', 'мільярда', 'мільярдаў'),  # 10^9
    4: ('трыльён', 'трыльёна', 'трыльёнаў'),  # 10^12
}

ONES_ORDINALS = {
    1: ("першы", "аднаго"),
    2: ("другі", "двух"),
    3: ("трэці", "трох"),
    4: ("чацвёрты", "чатырох"),
    5: ("пяты", "пяці"),
    6: ("шосты", "шэсці"),
    7: ("сёмы", "сямі"),
    8: ("восьмы", "васьмі"),
    9: ("дзявяты", "дзевяці"),
    10: ("дзясяты", "дзесяці"),
    11: ("адзінаццаты", "адзінаццаці"),
    12: ("дванаццаты", "дванаццаці"),
    13: ("трынаццаты", "трынаццаці"),
    14: ("чатырнаццаты", "чатырнаццаці"),
    15: ("пятнаццаты", "пятнаццаці"),
    16: ("шаснаццаты", "шаснаццаці"),
    17: ("сямнаццаты", "сямнаццаці"),
    18: ("васямнаццаты", "васямнаццаці"),
    19: ("дзевятнаццаты", "дзевятнаццаці"),
}

TWENTIES_ORDINALS = {
    2: ("дваццаты", "дваццаці"),
    3: ("трыццаты", "трыццаці"),
    4: ("саракавы", "сарака"),
    5: ("пяцьдзесяты", "пяцідзесяці"),
    6: ("шэсцьдзесяты", "шасцідзесяці"),
    7: ("сямідзясяты", "сямідзесяці"),
    8: ("васьмідзясяты", "васьмідзесяці"),
    9: ("дзевяносты", "дзевяноста"),
}

HUNDREDS_ORDINALS = {
    1: ("соты", "ста"),
    2: ("двухсоты", "двухсот"),
    3: ("трьохсоты", "трохсот"),
    4: ("чатырохсоты", "чатырохсот"),
    5: ("пяцісоты", "пяцісот"),
    6: ("шасцісоты", "шасцісот"),
    7: ("семісоты", "семісот"),
    8: ("васьмісоты", "васьмісот"),
    9: ("дзевяцісоты", "дзевяцісот"),
}

THOUSANDS_ORDINALS = {
    1: "тысячны",
    2: "мільёны",
    3: "мільярдны",
    4: "трыльёны",
}

GENERIC_DOLLARS = ('даляр', 'даляры', 'даляраў')
GENERIC_CENTS = ('цэнт', 'цэнты', 'цэнтаў')

CURRENCY_FORMS = {
    'EUR': (
            ('эўра', 'эўра', 'эўра'),
            GENERIC_CENTS
        ),
    'BYN': (
        ('беларускі рубель', 'беларускія рублі', 'беларускіх рублёў'),
        ('капейка', 'капейкі', 'капеек')
    ),
    'GBP': (
        ('фунт', 'фунты', 'фунтаў'),
        ('пенс', 'пенсы', 'пенсаў')
    ),
    'PLN': (
        ('злоты', 'злотыя', 'злотых'),
        ('грош', 'грошы', 'грошай')
    ),
}


def num2words(text: str):

    ln = len(text)
    if ln == 1:
        if text != '0':
            return ONES[int(text)]
        else:
            return ZERO

    if ln == 2:
        return TENS[int(text[0])] + ONES[int(text[0])]
    if ln == 3:
        if int(text[1]) > 1:
            if int(text[2]) != 0:
                return HUNDREDS[int(text[0])] + TWENTIES[int(text[1])] + ONES[int(text[2])]
            else:
                return HUNDREDS[int(text[0])] + TWENTIES[int(text[1])]
        elif int(text[1]) == 1:
            return HUNDREDS[int(text[0])] + TENS[int(text[2])]
        else:
            return HUNDREDS[int(text[0])] + ONES[int(text[2])]
